; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	spectrograph2 - mode
	image1 - mode
	image0 - mode
	Star3 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation0 - direction
	Star4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument2 image1)
	(supports instrument2 spectrograph2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon5)
	(supports instrument3 image0)
	(supports instrument3 image1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 spectrograph2)
	(supports instrument5 image0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
	(supports instrument6 image1)
	(supports instrument6 spectrograph2)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 image0)
	(calibration_target instrument7 Star1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 spectrograph2)
	(supports instrument9 image0)
	(calibration_target instrument9 Star1)
	(supports instrument10 image0)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation0)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon10)
)
(:goal (and
	(pointing satellite0 Phenomenon10)
	(pointing satellite3 GroundStation2)
	(pointing satellite4 Phenomenon5)
	(have_image Phenomenon5 image0)
	(have_image Star6 image0)
	(have_image Phenomenon7 spectrograph2)
	(have_image Phenomenon8 image1)
	(have_image Star9 image1)
	(have_image Phenomenon10 image1)
	(have_image Planet11 spectrograph2)
	(have_image Planet12 image0)
	(have_image Planet13 image1)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 2 of 12
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 2 of 12
3. (calibrate satellite3 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 2 of 12
4. (turn_to satellite4 phenomenon5 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon5)
   goals met: 3 of 12
5. (turn_to satellite3 phenomenon10 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon10)
   goals met: 2 of 12
6. (take_image satellite3 phenomenon10 instrument6 image1)
   added: (have_image phenomenon10 image1)
   goals met: 3 of 12
7. (turn_to satellite3 groundstation2 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 groundstation2)
   goals met: 4 of 12
8. (turn_to satellite3 phenomenon5 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon5)
   goals met: 3 of 12
9. (take_image satellite3 phenomenon5 instrument6 image0)
   added: (have_image phenomenon5 image0)
   goals met: 4 of 12
10. (turn_to satellite3 groundstation2 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 groundstation2)
   goals met: 5 of 12
11. (turn_to satellite3 phenomenon7 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon7)
   goals met: 4 of 12
12. (take_image satellite3 phenomenon7 instrument6 spectrograph2)
   added: (have_image phenomenon7 spectrograph2)
   goals met: 5 of 12
13. (turn_to satellite3 groundstation2 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 groundstation2)
   goals met: 6 of 12
14. (turn_to satellite3 phenomenon8 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon8)
   goals met: 5 of 12
15. (take_image satellite3 phenomenon8 instrument6 image1)
   added: (have_image phenomenon8 image1)
   goals met: 6 of 12
16. (turn_to satellite3 groundstation2 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 groundstation2)
   goals met: 7 of 12
17. (turn_to satellite3 planet11 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet11)
   goals met: 6 of 12
18. (take_image satellite3 planet11 instrument6 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 7 of 12
19. (turn_to satellite3 groundstation2 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 groundstation2)
   goals met: 8 of 12
20. (turn_to satellite3 planet12 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet12)
   goals met: 7 of 12
21. (take_image satellite3 planet12 instrument6 image0)
   added: (have_image planet12 image0)
   goals met: 8 of 12
22. (turn_to satellite3 groundstation2 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 groundstation2)
   goals met: 9 of 12
23. (turn_to satellite3 planet13 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet13)
   goals met: 8 of 12
24. (take_image satellite3 planet13 instrument6 image1)
   added: (have_image planet13 image1)
   goals met: 9 of 12
25. (turn_to satellite3 groundstation2 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 groundstation2)
   goals met: 10 of 12
26. (turn_to satellite3 star6 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star6)
   goals met: 9 of 12
27. (take_image satellite3 star6 instrument6 image0)
   added: (have_image star6 image0)
   goals met: 10 of 12
28. (turn_to satellite3 groundstation2 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 groundstation2)
   goals met: 11 of 12
29. (turn_to satellite3 star9 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star9)
   goals met: 10 of 12
30. (take_image satellite3 star9 instrument6 image1)
   added: (have_image star9 image1)
   goals met: 11 of 12
31. (turn_to satellite3 groundstation2 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 groundstation2)
   goals met: 12 of 12
